{
  "chemicals": [
    {
      "id": 0,
      "name": "Isoamyl Acetate",
      "description": "An ester compound with chemical formula CH3COO(CH2)2CH(CH3)2. Colorless transparent liquid at room temperature with a characteristic banana-like odor."
    },
    {
      "id": 1,
      "name": "2-Phenylethanol",
      "description": "An aromatic alcohol compound with chemical formula C6H5CH2CH2OH. Colorless oily liquid with a rose-like aroma."
    },
    {
      "id": 2,
      "name": "Methoxyphenols",
      "description": "A class of aromatic compounds containing methoxy (-OCH3) and hydroxyl (-OH) groups, derived from lignin degradation."
    },
    {
      "id": 3,
      "name": "Hexanoic Acid",
      "description": "A straight-chain saturated fatty acid with chemical formula CH3(CH2)4COOH. Oily liquid with a distinctive pungent odor."
    },
    {
      "id": 4,
      "name": "Linalool",
      "description": "A naturally occurring terpene alcohol with chemical formula C10H18O. Colorless liquid with a floral scent."
    },
    {
      "id": 5,
      "name": "Phenol",
      "description": "An aromatic organic compound with formula C6H5OH. White crystalline solid at room temperature with characteristic medicinal odor."
    },
    {
      "id": 6,
      "name": "Syringol",
      "description": "A dimethoxyphenol with chemical formula C8H10O3. White crystalline solid derived from wood smoke and lignin pyrolysis."
    },
    {
      "id": 7,
      "name": "Ethyl Acetate",
      "description": "An organic compound with chemical formula CH3COOC2H5. Colorless liquid with characteristic sweet smell."
    },
    {
      "id": 8,
      "name": "Acetaldehyde",
      "description": "An organic chemical compound with formula CH3CHO. Colorless, flammable liquid at room temperature with pungent odor."
    },
    {
      "id": 9,
      "name": "Benzaldehyde",
      "description": "An organic compound with formula C6H5CHO. Colorless liquid with characteristic almond-like odor."
    },
    {
      "id": 10,
      "name": "Vanillin",
      "description": "An organic compound with formula C8H8O3. White crystalline powder, primary component of vanilla bean extract."
    },
    {
      "id": 11,
      "name": "Furfural",
      "description": "An organic compound with formula C5H4O2. Colorless oily liquid that turns yellow-brown on exposure to air."
    },
    {
      "id": 12,
      "name": "Octanoic Acid",
      "description": "A saturated fatty acid with chemical formula CH3(CH2)6COOH. Oily liquid with unpleasant rancid-like odor."
    },
    {
      "id": 13,
      "name": "Diacetyl",
      "description": "An organic compound with formula (CH3CO)2. Yellow-green liquid with strong butter-like aroma."
    },
    {
      "id": 14,
      "name": "Lactones",
      "description": "Cyclic esters formed by internal esterification of hydroxycarboxylic acids. Various ring sizes possible."
    },
    {
      "id": 15,
      "name": "Methional",
      "description": "An organic sulfur compound with formula C4H8OS. Colorless liquid with characteristic cooked potato odor."
    },
    {
      "id": 16,
      "name": "4-Methylguaiacol",
      "description": "A methoxyphenol compound with formula C8H10O2. Colorless to pale yellow liquid derived from wood smoke."
    },
    {
      "id": 17,
      "name": "Guaiacol",
      "description": "An organic compound with formula C7H8O2. Yellowish aromatic oil derived from wood creosote and smoke."
    },
    {
      "id": 18,
      "name": "Eugenol",
      "description": "An allyl chain-substituted guaiacol with formula C10H12O2. Colorless to pale yellow oily liquid."
    },
    {
      "id": 19,
      "name": "Limonene",
      "description": "A cyclic monoterpene with formula C10H16. Colorless liquid with strong citrus odor."
    },
    {
      "id": 20,
      "name": "Maltol",
      "description": "Maltol is a naturally occurring organic compound that is used primarily as a flavor enhancer. It is found in nature in the bark of larch trees and in the needles of pine trees, and is produced during the roasting of malt (from which it gets its name) and in the baking of bread. It has the odor of caramel and is used to impart a pleasant aroma to foods and fragrances."
    },
    {
      "id": 21,
      "name": "Cresols",
      "description": "Cresol red can be used in many common molecular biology reactions in place of other loading dyes. Cresol Red does not inhibit Taq polymerase to the same degree as other common loading dyes."
    },
    {
      "id": 22,
      "name": "Hydroxymethylfurfural",
      "description": "Hydroxymethylfurfural (HMF), also known as 5-(hydroxymethyl)furfural, is an organic compound formed by the dehydration of reducing sugars.[4][5] It is a white low-melting solid (although commercial samples are often yellow) which is highly soluble in both water and organic solvents. The molecule consists of a furan ring, containing both aldehyde and alcohol functional groups."
    },
    {
      "id": 23,
      "name": "Lignin",
      "description": "Lignin is a class of complex organic polymers that form key structural materials in the support tissues of most plants.Lignins are particularly important in the formation of cell walls, especially in wood and bark, because they lend rigidity and do not rot easily. Chemically, lignins are polymers made by cross-linking phenolic precursors."
    },
    {
      "id": 24,
      "name": "Tannins",
      "description": "Tannins (or tannoids) are a class of astringent, polyphenolic biomolecules that bind to and precipitate proteins and various other organic compounds including amino acids and alkaloids."
    },
    {
      "id": 25,
      "name": "Glucose",
      "description": "Glucose is a sugar with the molecular formula C6H12O6. Glucose is overall the most abundant monosaccharide,[4] a subcategory of carbohydrates. Glucose is mainly made by plants and most algae during photosynthesis from water and carbon dioxide, using energy from sunlight. Glucose is used by plants to make cellulose—the most abundant carbohydrate in the world—for use in cell walls, and by all living organisms to make adenosine triphosphate (ATP), which is used by the cell as energy."
    },
    {
      "id": 26,
      "name": "Fructose",
      "description": "Fructose (/ˈfrʌktoʊs, -oʊz/), or fruit sugar, is a ketonic simple sugar found in many plants, where it is often bonded to glucose to form the disaccharide sucrose. It is one of the three dietary monosaccharides, along with glucose and galactose, that are absorbed by the gut directly into the blood of the portal vein during digestion. The liver then converts most fructose and galactose into glucose for distribution in the bloodstream or deposition into glycogen."
    },
    {
      "id": 27,
      "name": "Sucrose",
      "description": "Sucrose, a disaccharide, is a sugar composed of glucose and fructose subunits. It is produced naturally in plants and is the main constituent of white sugar. It has the molecular formula C12H22O11."
    },
    {
      "id": 28,
      "name": "Maltose",
      "description": "Maltose (/ˈmɔːltoʊs/[2] or /ˈmɔːltoʊz/[3]), also known as maltobiose or malt sugar, is a disaccharide formed from two units of glucose joined with an α(1→4) bond. In the isomer isomaltose, the two glucose molecules are joined with an α(1→6) bond. Maltose is the two-unit member of the amylose homologous series, the key structural motif of starch. When beta-amylase breaks down starch, it removes two glucose units at a time, producing maltose. An example of this reaction is found in germinating seeds, which is why it was named after malt.[4] Unlike sucrose, it is a reducing sugar.[5]"
    },
    {
      "id": 29,
      "name": "Aspartame",
      "description": "Aspartame is an artificial non-saccharide sweetener 200 times sweeter than sucrose and is commonly used as a sugar substitute in foods and beverages.[4] It is a methyl ester of the aspartic acid/phenylalanine dipeptide with brand names NutraSweet, Equal, and Canderel.[4] Aspartame was approved by the US Food and Drug Administration (FDA) in 1974, and then again in 1981, after approval was revoked in 1980."
    },
    {
      "id": 30,
      "name": "Hexyl Acetate",
      "description": "Hexyl acetate is an ester with the molecular formula C8H16O2. It is mainly used as a solvent for resins, polymers, fats and oils. It is also used as a paint additive to improve its dispersion on a surface."
    },
    {
      "id": 31,
      "name": "Fatty Acids",
      "description": "In chemistry, particularly in biochemistry, a fatty acid is a carboxylic acid with an aliphatic chain, which is either saturated or unsaturated. Most naturally occurring fatty acids have an unbranched chain of an even number of carbon atoms, from 4 to 28.[1] Fatty acids are a major component of the lipids (up to 70% by weight) in some species such as microalgae[2] but in some other organisms are not found in their standalone form, but instead exist as three main classes of esters: triglycerides, phospholipids, and cholesteryl esters. In any of these forms, fatty acids are both important dietary sources of fuel for animals and important structural components for cells."
    },
    {
      "id": 32,
      "name": "Cinnamaldehyde",
      "description": "Cinnamaldehyde is an organic compound with the formula C9H8Odisplaystyle {ce {C9H8O}}} or C₆H₅CH=CHCHO. Occurring naturally as predominantly the trans (E) isomer, it gives cinnamon its flavor and odor.[1] It is a phenylpropanoid that is naturally synthesized by the shikimate pathway.[2] This pale yellow, viscous liquid occurs in the bark of cinnamon trees and other species of the genus Cinnamomum. It is an essential oil. The bark of cinnamon tree contains high concentrations of cinnamaldehyde."
    },
    {
      "id": 33,
      "name": "Capsaicin",
      "description": "Capsaicin (8-methyl-N-vanillyl-6-nonenamide) (/kæpˈseɪsɪn/ or /kæpˈseɪəsɪn/) is an active component of chili peppers, which are plants belonging to the genus Capsicum. It is a potent irritant for mammals, including humans, and produces a sensation of burning in any tissue with which it comes into contact. Capsaicin and several related amides (capsaicinoids) are produced as secondary metabolites by chili peppers, likely as deterrents against certain mammals and fungi.[6] Pure capsaicin is a hydrophobic, colorless, highly pungent (i.e., spicy) crystalline solid."
    },
    {
      "id": 34,
      "name": "Piperine",
      "description": "Piperine is an alkaloid found in the seeds of the black pepper plant (Piper nigrum) and is structurally related to capsaicin, the active compound in chili peppers. It is a natural bioenhancer, which means it increases the absorption of other compounds. Piperine is also responsible for the pungency of black pepper and long pepper."
    },
    {
      "id": 35,
      "name": "Phenols",
      "description": "In organic chemistry, phenols, sometimes called phenolics, are a class of chemical compounds consisting of one or more hydroxyl groups (O H) bonded directly to an aromatic hydrocarbon group.[1] The simplest is phenol, C6H5OH. Phenolic compounds are classified as simple phenols or polyphenols based on the number of phenol units in the molecule."
    },
    {
      "id": 36,
      "name": "Acetic Acid",
      "description": "Acetic acid /əˈsiːtɪk/, systematically named ethanoic acid /ˌɛθəˈnoʊɪk/, is an acidic, colourless liquid and organic compound with the chemical formula CH3COOH (also written as CH3CO2H, C2H4O2, or HC2H3O2). Vinegar is at least 4% acetic acid by volume, making acetic acid the main component of vinegar apart from water. It has been used, as a component of vinegar, throughout history from at least the third century BC."
    }
  ],
  "flavours": [
    {
      "id": 0,
      "subType": "aroma",
      "name": "Vanilla",
      "description": "Vanilla is a popular aroma and flavor in whisky, derived from vanillin, a compound found in vanilla beans. This sweet, creamy note adds depth and richness to the whisky, complementing other flavors like caramel and oak.",
      "title": "Vanilla",
      "chemical": {
        "Vanillin": "1-2% (provides sweet, vanilla-like notes) ",
        "Lactones": "0.5-1% (adds creamy, coconut-like flavors) ",
        "Furfural": "0.1-0.5% (provides almond and caramel notes) ",
        "Maltol": "Trace amounts (adds sweetness and depth) ",
        "Sugars and Carbohydrates": "Varies (balances the sweetness) ",
        "Fatty Acids and Essentials Oils": "Minor components (enhance richness) "
      }
    },
    {
      "id": 1,
      "subType": "aroma",
      "name": "Peat",
      "description": "Peat's distinctive flavour comes from the phenolic compounds released during peat burning in whisky production. These compounds, such as guaiacol and cresols, impart a smoky, earthy character that defines peated whisky. The chemical of the peat flavour depends on the number of phenols present.",
      "title": "Peat",
      "chemical": {
        "Guaiacol": "1-2% (contributes to smoky, medicinal notes) ",
        "Cresols": "0.5-1% (adds earthy, tar-like flavours) ",
        "Phenol": "0.2-0.5% (provides antiseptic, Smokey character) ",
        "Methoxyphenols": "Trace amounts (contribute to spice and sweetness) ",
        "Sugars and Carbohydrates": "Varies (balances the harshness) ",
        "Fatty Acids and Essentials Oils": "Minor components (subtle richness) "
      }
    },
    {
      "id": 2,
      "subType": "aroma",
      "name": "Caramel",
      "description": "Caramel flavour derives from the heating of sugar during caramelization. This process produces a rich, sweet, and slightly bitter profile with hints of toffee and brown sugar. The complex reactions between sugars and amino acids give caramel its distinctive taste.",
      "title": "Caramel",
      "chemical": {
        "Maltol": "1-3% (sweet, caramelized flavor) ",
        "Diacetyl": "0.5-1% (buttery notes) ",
        "Furfural": "0.1-0.5% (provides toffee and almond flavors) ",
        "Hydroxymethylfurfural": "Trace amounts (adds bitterness) ",
        "Sugars": "Varies (contributes to sweetness and texture) ",
        "Fatty Acids": "Minor components (adds richness) "
      }
    },
    {
      "id": 3,
      "subType": "aroma",
      "name": "Oak",
      "description": "Oak contributes to whisky flavor through compounds released during barrel aging. These compounds, such as vanillin, lignin, and tannins, impart woody, spicy, and vanilla notes. The aging process in oak barrels gives whisky its complexity, with each compound adding depth to the flavor.",
      "title": "Oak",
      "chemical": {
        "Vanillin": "0.5-1.5% (provides sweet, vanilla-like notes) ",
        "Lignin": "0.2-1% (woody, smoky character) ",
        "Tannins": "0.1-0.5% (adds astringency and dryness) ",
        "Eugenol": "Trace amounts (spicy, clove-like flavor) ",
        "Sugars": "Varies (contributes to sweetness and texture) ",
        "Fatty Acids": "Minor components (adds richness) "
      }
    },
    {
      "id": 4,
      "subType": "taste",
      "name": "Sweet",
      "description": "Sweetness is primarily sensed through sugar molecules or other compounds that mimic their effect on taste receptors. This taste is generally associated with simple sugars like glucose and fructose, but can also come from artificial sweeteners, sugar alcohols, and other naturally occurring compounds. Sweet flavors balance out more intense or bitter tastes in foods and beverages.",
      "title": "Sweet",
      "chemical": {
        "Glucose": "1-3% (primary sweetening compound) ",
        "Fructose": "0.5-2% (contributes a more intense sweetness) ",
        "Sucrose": "0.5-1.5% (common table sugar, provides clean sweetness) ",
        "Maltose": "0.1-0.5% (adds depth with a slight malt-like flavor) ",
        "Aspartame": "Trace amounts (artificial sweetener, much sweeter than sugar) ",
        "Sugar Alcohols (Sorbitol, Xylitol)": "Trace amounts (used in sugar-free products, adds sweetness with less caloric impact) ",
        "Sugars and Carbohydrates": "Varies (provides bulk and texture) ",
        "Fatty Acids": "Minor components (can enhance richness in sweet products) "
      }
    },
    {
      "id": 5,
      "subType": "taste",
      "name": "Smoky",
      "description": "The smoky flavor commonly found in whisky and other foods comes from compounds formed during processes like peat burning, wood charring, or smoking over open flames. These compounds impart a deep, rich, and sometimes slightly medicinal smokiness.",
      "title": "Smoky",
      "chemical": {
        "Guaiacol": "0.5-2% (primary smoky and medicinal notes) ",
        "Phenols": "0.2-1% (adds antiseptic, charred flavors) ",
        "Cresols": "0.1-0.5% (contributes to tar-like, earthy notes) ",
        "Methoxyphenols": "Trace amounts (provides sweet, smoky nuances) ",
        "Acetic Acid": "Trace amounts (enhances complexity with acidity) ",
        "Sugars and Carbohydrates": "Varies (balances the intense smoky flavors) ",
        "Fatty Acids": "Minor components (adds richness and mouthfeel) "
      }
    },
    {
      "id": 6,
      "subType": "taste",
      "name": "Spicy",
      "description": "Spicy flavors in whisky come from compounds like eugenol and cinnamaldehyde, which are typically extracted from oak barrels or present in spices used in the distillation process. These compounds create warm, peppery, and sometimes clove-like notes.",
      "title": "Spicy",
      "chemical": {
        "Eugenol": "0.5-1.5% (primary spicy, clove-like flavor)",
        "Cinnamaldehyde": "0.1-0.5% (adds cinnamon and warmth)",
        "Capsaicin": "Trace amounts (provides a burning, peppery sensation)",
        "Piperine": "Trace amounts (adds black pepper notes)",
        "Sugars": "Varies (balances spiciness with sweetness)",
        "Essential Oils": "Minor components (enhances aromatic complexity)"
      }
    },
    {
      "id": 7,
      "subType": "taste",
      "name": "Fruity",
      "description": "Fruity flavors in whisky arise from esters and aldehydes formed during fermentation and aging. These compounds give off sweet, citrus, and stone fruit notes, balancing the more robust flavors of the whisky.",
      "title": "Fruity",
      "chemical": {
        "Ethyl Acetate": "1-3% (sweet, fruity, and pineapple-like flavor)",
        "Isoamyl Acetate": "0.5-1% (banana-like ester)",
        "Hexyl Acetate": "0.1-0.5% (adds green apple notes)",
        "Linalool": "Trace amounts (provides citrus, floral undertones)",
        "Sugars": "Varies (contributes to sweetness and texture)",
        "Fatty Acids and Esters": "Minor components (enhances the richness and mouthfeel)"
      }
    },
    {
      "id": 8,
      "subType": "finish",
      "name": "Length",
      "description": "The length of a whisky's finish refers to how long the flavors linger on the palate after swallowing. A long finish indicates a complex and well-balanced whisky, while a short finish may suggest a simpler or less mature spirit.",
      "title": "Length",
      "chemical": {
        "Isoamyl Acetate": "1-3% (provides a fruity, banana-like flavor)",
        "Hexanoic Acid": "0.5-1% (adds a buttery, fatty note)",
        "2-Phenylethanol": "0.1-0.5% (provides a floral, rose-like aroma)",
        "Furfural": "Trace amounts (adds almond and caramel notes)",
        "Sugars": "Varies (balances the sweetness and texture)",
        "Fatty Acids and Esters": "Minor components (enhances richness and mouthfeel)"
      }
    },
    {
      "id": 9,
      "subType": "finish",
      "name": "Warming",
      "description": "The warming sensation in whisky comes from the alcohol content and the compounds present in the spirit. A warming finish is often associated with higher ABV whiskies and can enhance the overall drinking experience.",
      "title": "Warming",
      "chemical": {
        "Ethyl Acetate": "1-3% (provides a fruity, pear-like flavor)",
        "Acetaldehyde": "0.5-1% (adds green apple and nutty notes)",
        "2-Phenylethanol": "0.1-0.5% (provides a floral, rose-like aroma)",
        "Hexanoic Acid": "Trace amounts (adds a buttery, fatty note)",
        "Sugars": "Varies (balances the sweetness and texture)",
        "Fatty Acids and Esters": "Minor components (enhances richness and mouthfeel)"
      }
    },
    {
      "id": 10,
      "subType": "finish",
      "name": "Dry",
      "description": "A dry finish in whisky refers to the lack of residual sweetness or stickiness on the palate after swallowing. Dry whiskies are often associated with tannins and other compounds that create a clean, crisp mouthfeel.",
      "title": "Dry",
      "chemical": {
        "Tannins": "1-3% (adds astringency and dryness)",
        "Sugars": "0.5-1% (provides a hint of sweetness)",
        "Lactones": "0.1-0.5% (adds creamy, coconut-like flavors)",
        "Octanoic Acid": "Trace amounts (provides a buttery, fatty note)",
        "Fatty Acids and Esters": "Varies (enhances richness and mouthfeel)"
      }
    },
    {
      "id": 11,
      "subType": "finish",
      "name": "Peaty",
      "description": "Peaty whiskies are characterized by the presence of phenolic compounds like guaiacol and cresols, which impart a smoky, earthy, and sometimes medicinal flavor. The peaty finish lingers on the palate, leaving a distinctive taste long after swallowing.",
      "title": "Peaty",
      "chemical": {
        "Guaiacol": "1-3% (provides smoky, medicinal notes)",
        "Cresols": "0.5-1% (adds earthy, tar-like flavors)",
        "Phenol": "0.1-0.5% (provides antiseptic, Smokey character)",
        "Hexanoic Acid": "Trace amounts (adds a buttery, fatty note)",
        "Fatty Acids and Esters": "Varies (enhances richness and mouthfeel)"
      }
    }
  ],
  "whiskeys": [
    {
      "id": 1,
      "name": "Maker's Mark (15 Years)",
      "brand": "Maker's Mark",
      "age": 15,
      "region": "Canada",
      "type": "Rye",
      "abv": 45,
      "description": "A rich, rye-based whisky from Canada with a 45% ABV, offering a sweet aroma of vanilla, caramel, and oak. On the palate, it delivers a smoky, spicy, and fruity taste with a long, warming finish. Chemical components include isoamyl acetate and hexanoic acid, contributing to its complex profile.",
      "price": 108,
      "bottlingDate": "2018-04-18",
      "caskType": "Sherry Oak",
      "specialNote": "Popular Release",
      "flavours": [1, 5, 9, 10, 3, 3, 1, 2, 6, 4, 1, 5],
      "chemicals": [54, 87, 0, 6, 0, 0, 0, 0, 0, 0, 0, 52, 0, 0, 0, 0, 0, 0, 99, 0]
    },
    {
      "id": 2,
      "name": "Macallan (NAS)",
      "brand": "Macallan",
      "age": 0,
      "region": "USA",
      "type": "Rye",
      "abv": 43,
      "description": "A USA-based rye whisky with 43% ABV, featuring vanilla and caramel on the nose, paired with smoky and fruity flavors. The finish is warm and dry, with notable compounds such as vanillin and 2-phenylethanol, adding depth to the overall experience.",
      "price": 44,
      "bottlingDate": "2021-08-06",
      "caskType": "French Oak",
      "specialNote": "Award-winning",
      "flavours": [2, 5, 10, 10, 4, 7, 6, 1, 4, 3, 5, 8],
      "chemicals": [0, 96, 0, 0, 0, 0, 0, 28, 77, 0, 42, 0, 0, 0, 0, 0, 0, 0, 0, 72]
    },
    {
      "id": 3,
      "name": "Talisker (NAS)",
      "brand": "Talisker",
      "age": 0,
      "region": "Japan",
      "type": "Single Malt",
      "abv": 55,
      "description": "A bold single malt from Japan with 55% ABV, showcasing strong notes of peat and oak. The taste is a complex mix of smoky, spicy, and fruity elements, with a long, peaty finish. Chemical compounds like hexanoic acid and phenol contribute to its robust profile.",
      "price": 46,
      "bottlingDate": "2019-06-27",
      "caskType": "Ex-Sherry",
      "specialNote": "Small Batch",
      "flavours": [8, 8, 3, 4, 1, 7, 1, 5, 10, 8, 8, 10],
      "chemicals": [0, 19, 0, 11, 73, 46, 0, 0, 0, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 4,
      "name": "Glenfiddich (12 Years)",
      "brand": "Glenfiddich",
      "age": 12,
      "region": "Ireland",
      "type": "Blended",
      "abv": 55,
      "description": "An Irish blended whisky with 55% ABV, offering a fruity, sweet aroma of vanilla and peat. On the palate, it brings a blend of sweet and spicy notes with a dry, peaty finish, highlighted by hexanoic acid and methoxyphenols.",
      "price": 72,
      "bottlingDate": "2022-03-09",
      "caskType": "American Oak",
      "specialNote": "Cask Strength",
      "flavours": [7, 7, 1, 1, 2, 3, 9, 7, 7, 6, 4, 10],
      "chemicals": [0, 0, 70, 94, 0, 0, 66, 0, 0, 27, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 5,
      "name": "Ardbeg (15 Years)",
      "brand": "Ardbeg",
      "age": 15,
      "region": "Ireland",
      "type": "Scotch",
      "abv": 50,
      "description": "A 50% ABV Scotch from Ireland, known for its smoky and fruity aromas of vanilla and oak. The taste is smoky and spicy, with a long, warming finish. Its rich profile is supported by diacetyl and 2-phenylethanol.",
      "price": 143,
      "bottlingDate": "2019-10-13",
      "caskType": "American Oak",
      "specialNote": "Award-winning",
      "flavours": [2, 2, 1, 2, 8, 9, 9, 7, 3, 4, 7, 10],
      "chemicals": [42, 72, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 27, 88, 0, 0, 0, 0, 90]
    },
    {
      "id": 6,
      "name": "Glenfiddich (15 Years)",
      "brand": "Glenfiddich",
      "age": 15,
      "region": "Scotland",
      "type": "Bourbon",
      "abv": 40,
      "description": "A smooth Scotch from Scotland with 40% ABV, featuring a sweet, fruity aroma of caramel and oak. It delivers a well-balanced sweet, smoky, and spicy palate with a long, warm, peaty finish. Phenol and vanillin add complexity.",
      "price": 35,
      "bottlingDate": "2021-08-14",
      "caskType": "Ex-Bourbon",
      "specialNote": "Small Batch",
      "flavours": [5, 1, 3, 6, 9, 2, 4, 5, 10, 7, 2, 2],
      "chemicals": [46, 0, 0, 0, 0, 37, 0, 0, 0, 0, 43, 0, 0, 0, 0, 62, 17, 0, 0, 0]
    },
    {
      "id": 7,
      "name": "Glenfiddich (8 Years)",
      "brand": "Glenfiddich",
      "age": 8,
      "region": "USA",
      "type": "Blended",
      "abv": 45,
      "description": "A USA-based blended whisky with 45% ABV, featuring vanilla and caramel aromas, paired with a sweet, fruity taste. Its long, smoky finish is enhanced by acetaldehyde and isoamyl acetate.",
      "price": 58,
      "bottlingDate": "2022-11-27",
      "caskType": "American Oak",
      "specialNote": "Limited Edition",
      "flavours": [2, 2, 9, 6, 5, 6, 5, 10, 1, 7, 4, 7],
      "chemicals": [50, 64, 0, 26, 0, 0, 0, 0, 19, 0, 0, 34, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 8,
      "name": "Highland Park (18 Years)",
      "brand": "Highland Park",
      "age": 18,
      "region": "Japan",
      "type": "Scotch",
      "abv": 55,
      "description": "A 55% ABV Scotch from Japan, with a rich vanilla and oak aroma. The taste is sweet, smoky, and fruity, leading to a long, warming finish with notable eugenol and linalool compounds, adding depth. ",
      "price": 141,
      "bottlingDate": "2023-12-07",
      "caskType": "American Oak",
      "specialNote": "Popular Release",
      "flavours": [5, 5, 6, 10, 10, 4, 5, 8, 4, 9, 5, 3],
      "chemicals": [49, 0, 0, 0, 96, 0, 0, 0, 90, 0, 0, 92, 0, 0, 0, 0, 0, 0, 73, 0]
    },
    {
      "id": 9,
      "name": "Maker's Mark (18 Years)",
      "brand": "Maker's Mark",
      "age": 18,
      "region": "Scotland",
      "type": "Scotch",
      "abv": 40,
      "description": "A Scotch whisky from Scotland, with 40% ABV, presenting strong vanilla and caramel aromas. It offers a sweet, smoky palate with a long, dry finish, supported by furfural and phenol.",
      "price": 78,
      "bottlingDate": "2021-06-10",
      "caskType": "Sherry Oak",
      "specialNote": "Cask Strength",
      "flavours": [10, 5, 4, 1, 9, 10, 3, 9, 7, 6, 6, 2],
      "chemicals": [0, 0, 0, 0, 79, 27, 0, 0, 0, 0, 0, 29, 76, 0, 83, 0, 0, 0, 0, 0]
    },
    {
      "id": 10,
      "name": "Ardbeg (NAS) ",
      "brand": "Ardbeg",
      "age": 0,
      "region": "Japan",
      "type": "Bourbon",
      "abv": 50,
      "description": "A 50% ABV bourbon from Japan, showcasing a smoky, fruity aroma of vanilla and oak. The taste is sweet and spicy, with a dry, peaty finish, enriched by guaiacol and syringol. ",
      "price": 49,
      "bottlingDate": "2021-04-15",
      "caskType": "Ex-Bourbon",
      "specialNote": "Popular Release",
      "flavours": [3, 7, 8, 5, 2, 7, 9, 6, 2, 4, 4, 1],
      "chemicals": [49, 0, 0, 0, 0, 0, 62, 9, 0, 0, 0, 0, 0, 0, 31, 0, 0, 72, 0, 0]
    },
    {
      "id": 11,
      "name": "Laphroaig (8 Years) ",
      "brand": "Laphroaig",
      "age": 8,
      "region": "Ireland",
      "type": "Single Malt",
      "abv": 40,
      "description": "A single malt from Ireland with 40% ABV, offering a sweet, smoky aroma of vanilla and caramel. The palate is smoky and fruity, with a long, warming finish, driven by phenol and hexanoic acid.",
      "price": 85,
      "bottlingDate": "2019-06-13",
      "caskType": "Ex-Bourbon",
      "specialNote": "Award-winning",
      "flavours": [4, 8, 3, 6, 7, 10, 4, 7, 9, 7, 2, 4],
      "chemicals": [0, 33, 0, 31, 0, 0, 26, 19, 0, 0, 0, 0, 0, 0, 32, 0, 0, 0, 0, 0]
    },
    {
      "id": 12,
      "name": "Macallan (12 Years) ",
      "brand": "Macallan",
      "age": 12,
      "region": "USA",
      "type": "Rye",
      "abv": 45,
      "description": "A rye whisky from the USA with 45% ABV, featuring a rich vanilla and oak aroma. It delivers a sweet, smoky palate with a long, peaty finish, supported by vanillin and isoamyl acetate. ",
      "price": 106,
      "bottlingDate": "2020-05-25",
      "caskType": "American Oak",
      "specialNote": "Cask Strength",
      "flavours": [7, 1, 10, 1, 4, 9, 8, 8, 9, 7, 5, 8],
      "chemicals": [77, 0, 0, 27, 47, 0, 0, 0, 0, 0, 62, 0, 0, 0, 0, 0, 0, 31, 0, 0]
    },
    {
      "id": 13,
      "name": "Laphroaig (NAS) ",
      "brand": "Laphroaig",
      "age": 0,
      "region": "Ireland",
      "type": "Rye",
      "abv": 50,
      "description": "A 50% ABV rye whisky from Ireland, offering intense smoky aromas of peat and oak. The taste is sweet and spicy, with a dry, warming finish enhanced by methoxyphenols and acetaldehyde. ",
      "price": 117,
      "bottlingDate": "2020-04-18",
      "caskType": "French Oak",
      "specialNote": "Award-winning",
      "flavours": [8, 6, 3, 7, 7, 1, 5, 4, 4, 6, 2, 9],
      "chemicals": [10, 92, 32, 0, 0, 95, 0, 0, 98, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 14,
      "name": " Lagavulin (12 Years) ",
      "brand": "Lagavulin",
      "age": 12,
      "region": "Ireland",
      "type": "Bourbon",
      "abv": 55,
      "description": "A 55% ABV bourbon from Ireland, showcasing rich caramel and oak aromas. The palate is sweet and smoky, with a long, peaty finish, highlighted by octanoic acid and diacetyl.",
      "price": 50,
      "bottlingDate": "2020-02-01",
      "caskType": "Sherry Oak",
      "specialNote": "Award-winning",
      "flavours": [4, 4, 2, 4, 5, 6, 1, 5, 5, 6, 10, 4],
      "chemicals": [0, 0, 0, 0, 73, 0, 0, 0, 36, 0, 0, 0, 17, 90, 0, 0, 16, 0, 0, 0]
    },
    {
      "id": 15,
      "name": "Maker's Mark (15 Years) ",
      "brand": "Maker's Mark",
      "age": 15,
      "region": "Ireland",
      "type": "Scotch",
      "abv": 50,
      "description": "A Scotch from Ireland with 50% ABV, offering a sweet, smoky aroma of vanilla and peat. The taste is fruity and spicy, with a long, warming finish, supported by syringol and benzaldehyde. ",
      "price": 133,
      "bottlingDate": "2020-04-20",
      "caskType": "French Oak",
      "specialNote": "Small Batch",
      "flavours": [1, 3, 3, 5, 5, 5, 5, 9, 5, 5, 1, 5],
      "chemicals": [0, 25, 0, 0, 0, 0, 89, 47, 0, 54, 0, 0, 0, 0, 0, 0, 28, 0, 0, 0]
    },
    {
      "id": 16,
      "name": "Laphroaig (10 Years) ",
      "brand": "Laphroaig",
      "age": 10,
      "region": "Canada",
      "type": "Bourbon",
      "abv": 43,
      "description": "A 43% ABV bourbon from Canada, featuring rich vanilla and caramel aromas. On the palate, it delivers a sweet and smoky flavor, with a dry, peaty finish enriched by limonene and guaiacol. ",
      "price": 133,
      "bottlingDate": "2020-08-09",
      "caskType": "American Oak",
      "specialNote": "Award-winning",
      "flavours": [3, 6, 8, 2, 9, 9, 3, 5, 2, 6, 1, 5],
      "chemicals": [0, 0, 91, 0, 0, 0, 0, 70, 0, 55, 0, 0, 0, 0, 0, 0, 0, 33, 0, 70]
    },
    {
      "id": 17,
      "name": "Macallan (15 Years) ",
      "brand": "Macallan",
      "age": 15,
      "region": "Scotland",
      "type": "Single Malt",
      "abv": 43,
      "description": "A 43% ABV single malt from Scotland, offering vanilla and oak aromas. The taste is smoky and fruity, with a long, peaty finish, supported by phenol and linalool. ",
      "price": 110,
      "bottlingDate": "2020-07-23",
      "caskType": "American Oak",
      "specialNote": "Small Batch",
      "flavours": [8, 4, 6, 7, 6, 7, 6, 4, 5, 2, 7, 9],
      "chemicals": [0, 88, 94, 0, 76, 40, 97, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 18,
      "name": "Macallan (15 Years) ",
      "brand": "Macallan",
      "age": 15,
      "region": "Japan",
      "type": "Blended",
      "abv": 40,
      "description": "A blended whisky from Japan with 40% ABV, featuring a sweet vanilla and caramel aroma. It offers a sweet, smoky palate with a long, warming finish, driven by isoamyl acetate and 2-phenylethanol. ",
      "price": 69,
      "bottlingDate": "2018-02-08",
      "caskType": "French Oak",
      "specialNote": "Small Batch",
      "flavours": [1, 7, 9, 8, 6, 6, 2, 5, 1, 9, 9, 4],
      "chemicals": [0, 7, 0, 32, 66, 0, 0, 91, 0, 0, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 19,
      "name": "Talisker (15 Years) ",
      "brand": "Talisker",
      "age": 15,
      "region": "Scotland",
      "type": "Rye",
      "abv": 50,
      "description": "A 50% ABV rye whisky from Scotland, known for its smoky, fruity aromas of vanilla and oak. The taste is spicy and fruity, with a long, dry finish supported by acetaldehyde and phenol. ",
      "price": 143,
      "bottlingDate": "2021-08-11",
      "caskType": "Ex-Bourbon",
      "specialNote": "Popular Release",
      "flavours": [5, 1, 9, 4, 5, 1, 10, 5, 9, 7, 10, 6],
      "chemicals": [7, 0, 81, 0, 0, 99, 0, 0, 55, 0, 87, 0, 0, 0, 0, 0, 0, 0, 0, 0]
    },
    {
      "id": 20,
      "name": "Ardbeg (18 Years)",
      "brand": "Ardbeg",
      "age": 18,
      "region": "USA",
      "type": "Rye",
      "abv": 45,
      "description": "A USA-based rye whisky with 45% ABV, featuring a rich aroma of vanilla and oak. The palate is sweet and spicy, with a long, smoky finish enriched by diacetyl and methional. ",
      "price": 36,
      "bottlingDate": "2018-07-26",
      "caskType": "Sherry Oak",
      "specialNote": "Limited Edition",
      "flavours": [6, 3, 4, 1, 9, 3, 10, 10, 7, 6, 1, 1],
      "chemicals": [0, 0, 96, 69, 22, 0, 0, 0, 0, 0, 0, 0, 0, 60, 0, 82, 0, 0, 0, 0]
    }
  ],
  "sortings": [
    {
      "title": "Default",
      "value": "default"
    },
    {
      "title": "Alcohol Percentage Low to High",
      "value": "alc-asc"
    },
    {
      "title": "Alcohol Percentage High to Low",
      "value": "alc-desc"
    },
    {
      "title": "Price Low to High",
      "value": "price-asc"
    },
    {
      "title": "Price High to Low",
      "value": "price-desc"
    },
    {
      "title": "Age Low to High",
      "value": "age-asc"
    },
    {
      "title": "Age High to Low",
      "value": "age-desc"
    }
  ],
  "brands": [
    {
      "title": "Maker's Mark",
      "value": "Maker's Mark"
    },
    {
      "title": "Macallan",
      "value": "Macallan"
    },
    {
      "title": "Talisker",
      "value": "Talisker"
    },
    {
      "title": "Glenfiddich",
      "value": "Glenfiddich"
    },
    {
      "title": "Ardbeg",
      "value": "Ardbeg"
    },
    {
      "title": "Highland Park",
      "value": "Highland Park"
    }
  ],
  "ages": [
    {
      "title": "15 years",
      "value": 15
    },
    {
      "title": "No Age",
      "value": 0
    },
    {
      "title": "12 years",
      "value": 12
    },
    {
      "title": "8 years",
      "value": 8
    },
    {
      "title": "18 years",
      "value": 18
    }
  ],
  "regions": [
    {
      "title": "Canada",
      "value": "Canada"
    },
    {
      "title": "USA",
      "value": "USA"
    },
    {
      "title": "Japan",
      "value": "Japan"
    },
    {
      "title": "Ireland",
      "value": "Ireland"
    },
    {
      "title": "Scotland",
      "value": "Scotland"
    }
  ],
  "types": [
    {
      "title": "Rye",
      "value": "Rye"
    },
    {
      "title": "Single Malt",
      "value": "Single Malt"
    },
    {
      "title": "Blended",
      "value": "Blended"
    },
    {
      "title": "Scotch",
      "value": "Scotch"
    },
    {
      "title": "Bourbon",
      "value": "Bourbon"
    }
  ],
  "abvs": [
    {
      "title": "45%",
      "value": 45
    },
    {
      "title": "43%",
      "value": 43
    },
    {
      "title": "55%",
      "value": 55
    },
    {
      "title": "50%",
      "value": 50
    },
    {
      "title": "40%",
      "value": 40
    }
  ],
  "caskTypes": [
    {
      "title": "Sherry Oak",
      "value": "Sherry Oak"
    },
    {
      "title": "French Oak",
      "value": "French Oak"
    },
    {
      "title": "Ex-Sherry",
      "value": "Ex-Sherry"
    },
    {
      "title": "American Oak",
      "value": "American Oak"
    },
    {
      "title": "Ex-Bourbon",
      "value": "Ex-Bourbon"
    }
  ],
  "specialNotes": [
    {
      "title": "Popular Release",
      "value": "Popular Release"
    },
    {
      "title": "Award-winning",
      "value": "Award-winning"
    },
    {
      "title": "Small Batch",
      "value": "Small Batch"
    },
    {
      "title": "Cask Strength",
      "value": "Cask Strength"
    },
    {
      "title": "Limited Edition",
      "value": "Limited Edition"
    }
  ]
}
